{
  "backend/main.mo": "Empty Motoko actor with no methods or state.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of key frontend files in the project.",
  "frontend/index.css": "Tailwind base and utility layers plus custom CSS variables defining theme colors and layout tokens for light and dark mode.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React component controlling navigation between the alphabet grid and letter‑specific words page with dynamic header and footer.",
  "frontend/src/components/AlphabetGrid.tsx": "Renders a responsive clickable A–Z grid that triggers navigation when a letter is selected.",
  "frontend/src/data/aWords.ts": "Static curated list of English words starting with A.",
  "frontend/src/data/letterWords.ts": "Unified static dataset mapping each letter A–Z to a curated word list.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous backend actor, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Authentication context and hooks for managing Internet Identity login, identity loading, and status tracking.",
  "frontend/src/index.css": "Defines global Tailwind layers, typography, and OKLCH color variables for light and dark themes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers, then renders App.",
  "frontend/src/pages/AWordsPage.tsx": "Empty placeholder file for the A-words page.",
  "frontend/src/pages/LetterWordsPage.tsx": "Renders a words list page for a selected letter with a back button, grid of word cards, and summary section.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions including OKLCH color tokens, typography, animations, and plugins.",
  "project_state.json": "Stores project metadata, existing features, and requirements for the alphabet and words listing app."
}