{
  "kind": "build_request",
  "title": "Add word pages for every alphabet letter (A–Z) and make all letters navigable",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-6",
      "text": "Update the alphabet grid so that every letter tile (A–Z) is clickable and triggers navigation to a corresponding words page for that letter.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Add pages of words related to each alphabet"
        ]
      },
      "acceptanceCriteria": [
        "On the main A–Z grid, clicking any letter A–Z navigates to a words page for that letter.",
        "Tiles visually indicate clickability consistently for all letters (not only A).",
        "The existing responsive grid layout remains intact on mobile and desktop."
      ]
    },
    {
      "id": "REQ-7",
      "text": "Refactor the frontend view/routing logic so the app can display a words page for any selected letter (A–Z), including updating the header subtitle to reflect the currently selected letter.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Add pages of words related to each alphabet"
        ]
      },
      "acceptanceCriteria": [
        "The app supports switching between the alphabet grid view and a letter words view for any selected letter A–Z.",
        "The header description changes to match the current view and selected letter (e.g., \"Explore words starting with B\").",
        "A clear \"Back to Alphabet\" control returns the user to the main A–Z grid."
      ]
    },
    {
      "id": "REQ-8",
      "text": "Add static, curated word lists for each letter B–Z (matching the existing approach used for A) and ensure the words page renders the correct list based on the selected letter.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Add pages of words related to each alphabet"
        ]
      },
      "acceptanceCriteria": [
        "There is a static, curated list of English words for every letter A–Z, with no external API calls.",
        "Selecting letter X displays only the X list and the count shown on the page matches the list length.",
        "Existing A words content continues to work and is included in the unified A–Z letter-to-words dataset."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (compose existing UI components instead).",
    "Do not modify immutable hook paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx.",
    "Keep backend as single-actor architecture; no backend changes are required for static word lists."
  ],
  "nonGoals": [
    "Adding backend persistence, admin tooling, or word list editing UI.",
    "Fetching words from external APIs or integrating dictionaries/thesauruses.",
    "Adding third-party authentication beyond the existing Internet Identity setup."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}