{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "A–Z navigable letter word pages with unified static datasets",
  "requirements": [
    {
      "id": "REQ-6",
      "summary": "Make every A–Z tile in the alphabet grid clickable and navigate to that letter’s words view while preserving the responsive grid layout.",
      "acceptanceCriteria": [
        "On the main A–Z grid, clicking any letter A–Z navigates to a words page for that letter.",
        "Tiles visually indicate clickability consistently for all letters (not only A).",
        "The existing responsive grid layout remains intact on mobile and desktop."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AlphabetGrid.tsx",
          "operation": "modify",
          "description": "Update the grid so all letters A–Z are interactive (consistent pointer/hover affordances) and always call onLetterClick(letter) when provided. Continue rendering using shadcn-ui Card/CardContent for consistent styling; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Refactor view state to support a words page for any selected letter and update header subtitle + add Back to Alphabet control.",
      "acceptanceCriteria": [
        "The app supports switching between the alphabet grid view and a letter words view for any selected letter A–Z.",
        "The header description changes to match the current view and selected letter (e.g., \"Explore words starting with B\").",
        "A clear \"Back to Alphabet\" control returns the user to the main A–Z grid."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/AWordsPage.tsx",
          "operation": "rename",
          "description": "Rename the existing A-only words page to a generic LetterWordsPage so it can render words for any selected letter without creating a new top-level route/page. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/LetterWordsPage.tsx",
          "operation": "modify",
          "description": "Refactor the page to accept a selected letter prop (A–Z), render the correct title/subtitle, show the count for that letter, and keep a clear Back to Alphabet control using shadcn-ui Button/Card components; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Refactor app view logic from an A-only toggle to a selectedLetter-driven view (alphabet vs letter words). Wire AlphabetGrid to set the selected letter for any A–Z click, render LetterWordsPage for the selected letter, and update the header subtitle dynamically (alphabet description vs \"Explore words starting with <LETTER>\")."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Create static curated word lists for B–Z and unify all A–Z word data so the words view renders the correct list with accurate counts (no external calls).",
      "acceptanceCriteria": [
        "There is a static, curated list of English words for every letter A–Z, with no external API calls.",
        "Selecting letter X displays only the X list and the count shown on the page matches the list length.",
        "Existing A words content continues to work and is included in the unified A–Z letter-to-words dataset."
      ],
      "file_operations": [
        {
          "path": "frontend/src/data/letterWords.ts",
          "operation": "create",
          "description": "Create a unified static A–Z letter-to-words dataset (including A via import from the existing aWords list) and export a small helper to retrieve the list for a given letter; ensure B–Z curated lists are included and no external API calls are introduced."
        },
        {
          "path": "frontend/src/pages/LetterWordsPage.tsx",
          "operation": "modify",
          "description": "Update the page to read words from the unified A–Z dataset (instead of the A-only list), ensuring only the selected letter’s list is rendered and the displayed count matches the list length. Continue using shadcn-ui components for the word cards and layout; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}